# Taps
tap 'hashicorp/tap'
tap 'bufbuild/buf'
tap 'ankitpokhrel/jira-cli'
tap 'sst/tap'

# System Utilities
brew 'coreutils'        # GNU core utilities (better versions of basic commands)
brew 'gnu-sed'          # GNU sed (more features than macOS sed)
brew 'htop'             # Interactive process viewer (better than top)
brew 'bottom'           # Modern system monitor (alternative to htop)
brew 'curl'             # Command line HTTP client
brew 'wget'             # File downloader
brew 'tmux'             # Terminal multiplexer for session management
brew 'zellij'            # Modern terminal multiplexer with built-in session management
brew 'vim'              # Text editor (fallback when neovim unavailable)
brew 'unzip'            # Archive extraction utility
brew 'watch'            # Execute commands repeatedly and display output
brew 'mas'              # Mac App Store command line interface

# File & Text Tools
brew 'bat'              # Cat clone with syntax highlighting and git integration
brew 'fd'               # Fast and user-friendly alternative to find
brew 'fzf'              # Fuzzy finder for command line
brew 'carapace'         # Universal shell completion generator
brew 'ripgrep'          # Fast text search tool (better than grep)
brew 'tree'             # Display directory structure as tree
brew 'eza'              # Modern replacement for ls with colors and icons
brew 'zoxide'           # Smart cd command that learns your habits
brew 'jq'               # JSON processor and query tool
brew 'glow'             # Markdown renderer for terminal
brew 'tlrc'             # Community-driven man pages with practical examples
brew 'dust'             # Modern du alternative for disk usage analysis
brew 'procs'            # Modern ps alternative with better output

# Development Tools
brew 'git'              # Version control system
brew 'gh'               # GitHub CLI for repository management
brew 'tig'              # Text-mode interface for git
brew 'git-delta'        # Better git diff viewer with syntax highlighting
brew 'lazygit'          # Simple terminal UI for git commands
brew 'neovim'           # Modern vim-based text editor
brew 'sst/tap/opencode' # AI coding assistant

# Languages & Runtimes
brew 'go'               # Go programming language
brew 'rust'             # Rust programming language
brew 'node'             # Node.js JavaScript runtime
brew 'ruby'             # Ruby programming language
brew 'rbenv'            # Ruby version manager

# DevOps & Infrastructure
brew 'kubectl'          # Kubernetes command line tool
brew 'k3d'              # Lightweight Kubernetes in Docker
brew 'minikube'         # Local Kubernetes development environment
brew 'kubectl-argo-rollouts' # Kubectl plugin for Argo Rollouts
brew 'argocd'           # GitOps continuous delivery tool
brew 'terraform'        # Infrastructure as code tool
brew 'terraform-ls'     # Terraform language server
brew 'mkcert'           # Create locally-trusted development certificates
brew 'ko'               # Build and deploy Go applications on Kubernetes
brew 'helm'             # Kubernetes package manager

# Networking & Security
brew 'nmap'             # Network discovery and security auditing
brew 'ipcalc'           # IP address calculator
brew 'iperf'            # Network bandwidth measurement tool

# Media & Graphics
brew 'ffmpeg'           # Multimedia framework for audio/video processing
brew 'graphviz'         # Graph visualization software

# Protocol Buffers & gRPC
brew 'buf'              # Protocol buffer toolkit
brew 'grpc'             # gRPC framework
brew 'protoc-gen-go-grpc' # Go gRPC code generator

# Monitoring & Testing
brew 'viddy'            # Modern watch command with time machine
brew 'k6'               # Load testing tool
brew 'dive'             # Docker image layer analyzer

# API & HTTP Tools
brew 'httpie'           # User-friendly HTTP client (better than curl for APIs)
brew 'yq'               # YAML processor (like jq but for YAML)

# Project Management
brew 'jira-cli'         # Command line interface for Jira

# Casks
# Applications
cask 'arc'                # Web browser
cask 'choosy'             # Browser picker
cask 'claude'             # AI assistant
cask 'docker'             # Containerization platform
cask 'ghostty'            # Terminal emulator
cask 'google-cloud-sdk'   # Google Cloud CLI
cask 'google-drive'       # Cloud storage
cask 'hiddenbar'          # Hide menu bar icons
cask 'iina'               # Video player
cask 'kap'                # Screen recorder
cask 'notion'             # Workspace for notes, tasks, wikis
cask 'openlens'           # Kubernetes IDE
cask 'osquery'            # SQL powered operating system analytics
cask 'raycast'            # Productivity launcher
cask 'signal'             # Encrypted messaging app
cask 'slack'              # Team communication
cask 'spotify'            # Music streaming
cask 'tableplus'          # Database client
cask 'visual-studio-code' # Code editor
cask 'wezterm'            # GPU-accelerated cross-platform terminal emulator
cask 'whatsapp'           # Messaging app
cask 'zoom'               # Video conferencing

# Fonts
cask 'font-monaspace'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'

# App Store
mas "Copy'em", id: 876540291
mas "Tailscale", id: 1475387142
